const channel = [
  { id: 1, name: '两会' },
  { id: 2, name: '财经' },
  { id: 3, name: '科技' },
  { id: 4, name: '热点' },
  { id: 5, name: '国际' },
  { id: 6, name: '体育' }
]

const newsInfo = [
  {
    id: 1,
    title: '新闻标题新闻标题新闻标题新闻标题新闻标题新闻标题新闻标题新闻标题新闻标题新闻标题新闻标题新闻标题',
    content:
      '内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容',
    date: '2023-03-09',
    author: '某作者'
  },
  {
    id: 1,
    title: '新闻标题新闻标题新闻标题新闻标题',
    content:
      '内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容',
    date: '2023-03-09',
    author: '某作者'
  },
  {
    id: 1,
    title: '新闻标题新闻标题新闻标题新闻标题',
    content:
      '内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容',
    date: '2023-03-09',
    author: '某作者'
  },
  {
    id: 1,
    title: '新闻标题新闻标题新闻标题新闻标题',
    content:
      '内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容',
    date: '2023-03-09',
    author: '某作者'
  },
  {
    id: 1,
    title: '新闻标题新闻标题新闻标题新闻标题',
    content:
      '内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容',
    date: '2023-03-09',
    author: '某作者'
  },
  {
    id: 1,
    title: '新闻标题新闻标题新闻标题新闻标题',
    content:
      '内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容',
    date: '2023-03-09',
    author: '某作者'
  }
]

const mySubscribe = [
  { id: 1, name: '新华社', headUrl: './src/assets/user.png', isSubscribe: true },
  { id: 2, name: '澎湃新闻', headUrl: './src/assets/user.png', isSubscribe: true },
  { id: 3, name: '中工网', headUrl: './src/assets/user.png', isSubscribe: true }
]
const myCollect = []

export default defineStore({
  id: 'news',
  state: () => {
    return {
      channel,
      newsInfo,
      mySubscribe,
      myCollect
    }
  },
  getters: {},
  actions: {
    setMySubscribeInfo(val) {
      this.mySubscribe[val.index].isSubscribe = val.isSubscribe
    }
  }
})
